#language: ru

@1
Функционал: Поиск на авито
  Сценарий: Найдем самые дорогие принтеры на авито
    Пусть открыт ресурс авито
    И в выпадающем списке категорий выбрана оргтехника_и_расходники
    И в поле поиска введено значение "Принтер"
    Тогда кликнуть по выпадающему списку региона
    Тогда в поле регион введено значение "Владивосток"
    И нажата кнопка показать объявления
    Тогда открылась страница результаты по запросу "Принтер"
    И активирован чекбокс только с фотографией
    И в выпадающем списке сортировка выбрано значение Дороже
    И в консоль выведено значение названия и цены 3 первых товаров